{
  fakeData = [
    { "name" : "Greta Bartell", "group" : "Проектный отдел" }, { "name" : "Kaitlin Koss", "group" : "Проектный отдел" }, {
      "name"  : "Tyrese Heidenreich",
      "group" : "Руководство"
    }, { "name" : "Juanita Runolfsson", "group" : "Проектный отдел" }, {
      "name"  : "Michaela Kuhlman",
      "group" : "Проектный отдел"
    }, { "name" : "Xander Lebsack" }, { "name" : "Jaron Crooks", "group" : "Бухгалтерия" }, { "name" : "Judge Okuneva", "group" : "Бухгалтерия" }, {
      "name"  : "Nikki Herman",
      "group" : "Проектный отдел"
    }, { "name" : "Leola Howe", "group" : "Проектный отдел" }, { "name" : "Irma Muller" }, {
      "name"  : "Turner Stehr",
      "group" : "Отдел кадров"
    }, { "name" : "Rory Brekke" }, { "name" : "Brandi Schaefer", "group" : "Руководство" }, { "name" : "Imogene Lubowitz", "group" : "Бухгалтерия" }, {
      "name"  : "Carli Hills",
      "group" : "Руководство"
    }, { "name" : "Florencio Leuschke" }, { "name" : "Alyson Lueilwitz", "group" : "Отдел кадров" }, {
      "name"  : "Rachael Terry",
      "group" : "Отдел кадров"
    }, { "name" : "Micheal Metz", "group" : "Отдел кадров" }, { "name" : "Laisha Mante", "group" : "Проектный отдел" }, {
      "name"  : "Marge Kessler",
      "group" : "Бухгалтерия"
    }, { "name" : "Zola Champlin", "group" : "Бухгалтерия" }, { "name" : "Hazel Schmitt", "group" : "Проектный отдел" }, {
      "name"  : "Twila Blick",
      "group" : "Руководство"
    }, { "name" : "Edyth McClure", "group" : "Отдел кадров" }, { "name" : "Buddy Witting", "group" : "Бухгалтерия" }, {
      "name"  : "Delia Bogan",
      "group" : "Проектный отдел"
    }, { "name" : "Jordyn Cormier", "group" : "Бухгалтерия" }, {
      "name"  : "Jaquan Sporer",
      "group" : "Отдел кадров"
    }, { "name" : "Weldon Maggio" }, { "name" : "Orlando Kunde" }, { "name" : "Hilda MacGyver", "group" : "Руководство" }, {
      "name"  : "Alek McLaughlin",
      "group" : "Отдел кадров"
    }, { "name" : "Ana Rogahn", "group" : "Проектный отдел" }, { "name" : "Richmond Ebert" }, { "name" : "Norwood Stark", "group" : "Проектный отдел" }, {
      "name"  : "Declan Feest",
      "group" : "Руководство"
    }, { "name" : "Louisa Champlin", "group" : "Отдел кадров" }, { "name" : "Aurelia Gislason", "group" : "Руководство" }, {
      "name"  : "Jordyn Graham",
      "group" : "Отдел кадров"
    }, { "name" : "Richmond Glover", "group" : "Руководство" }, { "name" : "Macie Ortiz", "group" : "Отдел кадров" }, {
      "name"  : "Abraham Collins",
      "group" : "Отдел кадров"
    }, { "name" : "Colt Fay", "group" : "Проектный отдел" }, { "name" : "Adeline Goodwin", "group" : "Бухгалтерия" }, {
      "name"  : "Jadon Lubowitz",
      "group" : "Проектный отдел"
    }, { "name" : "Vince Goyette", "group" : "Бухгалтерия" }, {
      "name"  : "Coy Renner",
      "group" : "Руководство"
    }, { "name" : "Maribel Rohan" }, { "name" : "Drake Aufderhar" }, { "name" : "Trever Willms" }, {
      "name"  : "Millie Littel",
      "group" : "Проектный отдел"
    }, { "name" : "Dion Schuppe", "group" : "Бухгалтерия" }, { "name" : "Myra Hahn", "group" : "Проектный отдел" }, {
      "name"  : "Kenyatta Heidenreich",
      "group" : "Руководство"
    }, { "name" : "Miles O'Conner", "group" : "Проектный отдел" }, { "name" : "Nat Bartoletti", "group" : "Отдел кадров" }, {
      "name"  : "Kole Kiehn",
      "group" : "Бухгалтерия"
    }, { "name" : "Shakira Kertzmann", "group" : "Руководство" }, { "name" : "Lesly Skiles", "group" : "Отдел кадров" }, {
      "name"  : "Nils Schuppe",
      "group" : "Бухгалтерия"
    }, { "name" : "Burnice Towne", "group" : "Отдел кадров" }, { "name" : "Marlon Wolf", "group" : "Отдел кадров" }, {
      "name"  : "Tania Olson",
      "group" : "Отдел кадров"
    }, { "name" : "Greta Gleason", "group" : "Проектный отдел" }, { "name" : "Crystal Frami", "group" : "Бухгалтерия" }, {
      "name"  : "Isaac Windler",
      "group" : "Бухгалтерия"
    }, { "name" : "Marquise Watsica", "group" : "Бухгалтерия" }, { "name" : "Odessa Rempel", "group" : "Отдел кадров" }, {
      "name"  : "Tyrell Predovic",
      "group" : "Бухгалтерия"
    }, { "name" : "Kenneth Waters", "group" : "Бухгалтерия" }, { "name" : "Mariana Goyette", "group" : "Проектный отдел" }, {
      "name"  : "Kenyatta Kozey",
      "group" : "Бухгалтерия"
    }, { "name" : "Mike Terry" }, { "name" : "Shemar Miller" }, { "name" : "Paolo Rohan", "group" : "Проектный отдел" }, {
      "name"  : "Edmund Konopelski",
      "group" : "Проектный отдел"
    }, { "name" : "Horacio Murray", "group" : "Бухгалтерия" }, { "name" : "Tressa Emmerich" }, { "name" : "Jamie Rice", "group" : "Отдел кадров" }, {
      "name"  : "Hayley Bins",
      "group" : "Проектный отдел"
    }, { "name" : "Florida Block", "group" : "Бухгалтерия" }, { "name" : "Kathleen Monahan", "group" : "Отдел кадров" }, {
      "name"  : "Lynn Kub",
      "group" : "Проектный отдел"
    }, { "name" : "Maritza Sanford", "group" : "Бухгалтерия" }, { "name" : "Kailee Spinka", "group" : "Проектный отдел" }, {
      "name"  : "Grace Gorczany",
      "group" : "Бухгалтерия"
    }, { "name" : "Samara Lind" }, { "name" : "Casper Daniel", "group" : "Отдел кадров" }, { "name" : "Keagan Abbott", "group" : "Проектный отдел" }, {
      "name"  : "Karen Mohr",
      "group" : "Бухгалтерия"
    }, { "name" : "Delores Witting" }, { "name" : "Jamaal Morar", "group" : "Проектный отдел" }, { "name" : "Lucile Koch", "group" : "Отдел кадров" }, {
      "name"  : "Milo O'Conner",
      "group" : "Бухгалтерия"
    }, { "name" : "Ashleigh Becker", "group" : "Отдел кадров" }, { "name" : "Ward Batz", "group" : "Отдел кадров" }, {
      "name"  : "Lolita Torp",
      "group" : "Проектный отдел"
    }, { "name" : "Walker Kuvalis", "group" : "Бухгалтерия" }, { "name" : "Tania Beer", "group" : "Бухгалтерия" }, {
      "name"  : "Bernadine McDermott",
      "group" : "Бухгалтерия"
    }, { "name" : "Justine Morissette", "group" : "Проектный отдел" }, { "name" : "Brooklyn Kovacek", "group" : "Руководство" }, {
      "name"  : "Golden Kemmer",
      "group" : "Отдел кадров"
    }, { "name" : "Kennedy Hermann", "group" : "Проектный отдел" }, { "name" : "Rocio Denesik", "group" : "Проектный отдел" }, {
      "name"  : "Anabel Boyer",
      "group" : "Проектный отдел"
    }, { "name" : "Reta Klocko", "group" : "Отдел кадров" }, { "name" : "Florida Schamberger", "group" : "Бухгалтерия" }, {
      "name"  : "Haskell Donnelly",
      "group" : "Бухгалтерия"
    }, { "name" : "Flossie King", "group" : "Руководство" }, { "name" : "Ari Schaefer", "group" : "Руководство" }, {
      "name"  : "Abigail Rowe",
      "group" : "Бухгалтерия"
    }, { "name" : "Taya MacGyver", "group" : "Отдел кадров" }, { "name" : "Dewitt Bernier" }, {
      "name"  : "Orval Bogisich",
      "group" : "Бухгалтерия"
    }, { "name" : "Kristy Koss" }, { "name" : "Ruthie Jerde", "group" : "Руководство" }, {
      "name"  : "Maya Jast",
      "group" : "Проектный отдел"
    }, { "name" : "Ari Pouros" }, { "name" : "Nolan Yost", "group" : "Бухгалтерия" }, { "name" : "Deshaun Tremblay" }, {
      "name"  : "Alverta Lynch",
      "group" : "Отдел кадров"
    }, { "name" : "Sedrick Ruecker", "group" : "Бухгалтерия" }, { "name" : "Irwin Murphy" }, { "name" : "Constance Kuphal" }, {
      "name"  : "Carlos Littel",
      "group" : "Бухгалтерия"
    }, { "name" : "Dulce Kuhlman", "group" : "Проектный отдел" }, { "name" : "Velva Streich", "group" : "Проектный отдел" }, {
      "name"  : "Megane Jacobson",
      "group" : "Отдел кадров"
    }, { "name" : "Chasity Schmeler", "group" : "Проектный отдел" }, { "name" : "Sunny Durgan", "group" : "Руководство" }, {
      "name"  : "Darrel Dicki",
      "group" : "Бухгалтерия"
    }, { "name" : "Lucienne McGlynn", "group" : "Бухгалтерия" }, { "name" : "Camila Koch", "group" : "Отдел кадров" }, {
      "name"  : "Davion Bogan",
      "group" : "Руководство"
    }, { "name" : "Isaias Carter", "group" : "Отдел кадров" }, { "name" : "Paxton Bogisich", "group" : "Проектный отдел" }, {
      "name"  : "Ian Gleason",
      "group" : "Проектный отдел"
    }, { "name" : "Vern Rath", "group" : "Проектный отдел" }, { "name" : "Delphia Mills", "group" : "Проектный отдел" }, {
      "name"  : "Carissa Bayer",
      "group" : "Отдел кадров"
    }, { "name" : "Jammie Johnston" }, { "name" : "Esteban Volkman", "group" : "Проектный отдел" }, {
      "name"  : "Sidney Olson",
      "group" : "Проектный отдел"
    }, { "name" : "Jonas Shanahan", "group" : "Отдел кадров" }, { "name" : "Frieda Veum", "group" : "Руководство" }, {
      "name"  : "Orville Torp",
      "group" : "Проектный отдел"
    }, { "name" : "Grayce Auer", "group" : "Отдел кадров" }, { "name" : "Maya Torphy", "group" : "Проектный отдел" }, {
      "name"  : "Kathryne Abshire",
      "group" : "Проектный отдел"
    }, { "name" : "Hilton Hyatt", "group" : "Бухгалтерия" }, { "name" : "Retta Nikolaus", "group" : "Проектный отдел" }, {
      "name"  : "Idella Tremblay",
      "group" : "Отдел кадров"
    }, { "name" : "Anthony Upton", "group" : "Бухгалтерия" }, { "name" : "Merritt Reynolds", "group" : "Бухгалтерия" }, { "name" : "Lorine Leannon" }, {
      "name"  : "Lulu O'Connell",
      "group" : "Руководство"
    }, { "name" : "Nikko Kautzer", "group" : "Бухгалтерия" }, { "name" : "Darby Maggio", "group" : "Проектный отдел" }, { "name" : "Yvonne Sipes" }, {
      "name"  : "Veronica Hyatt",
      "group" : "Отдел кадров"
    }, { "name" : "Noel Kris", "group" : "Проектный отдел" }, { "name" : "Abbigail Mraz", "group" : "Проектный отдел" }, {
      "name"  : "Malcolm Gleichner",
      "group" : "Проектный отдел"
    }, { "name" : "Margarete Goodwin" }, { "name" : "Amani Shanahan", "group" : "Отдел кадров" }, {
      "name"  : "Alexandra Gleason",
      "group" : "Руководство"
    }, { "name" : "Hugh Flatley", "group" : "Руководство" }, { "name" : "Titus Reilly", "group" : "Проектный отдел" }, {
      "name"  : "Deshaun Oberbrunner",
      "group" : "Руководство"
    }, { "name" : "Heidi Ondricka", "group" : "Отдел кадров" }, { "name" : "Archibald Hilll", "group" : "Руководство" }, {
      "name"  : "Asia Rogahn",
      "group" : "Отдел кадров"
    }, { "name" : "Minnie Boehm", "group" : "Руководство" }, { "name" : "Rosemary Blick", "group" : "Руководство" }, {
      "name"  : "Adonis Daniel",
      "group" : "Руководство"
    }, { "name" : "Adolfo Balistreri", "group" : "Отдел кадров" }, { "name" : "Gennaro Quitzon", "group" : "Проектный отдел" }, {
      "name"  : "Ava Bahringer",
      "group" : "Отдел кадров"
    }, { "name" : "Julie Johnston", "group" : "Проектный отдел" }, { "name" : "Susanna Dicki", "group" : "Проектный отдел" }, {
      "name"  : "Bruce Wintheiser",
      "group" : "Бухгалтерия"
    }, { "name" : "Annalise Sawayn", "group" : "Бухгалтерия" }, { "name" : "Colby Rutherford", "group" : "Проектный отдел" }, {
      "name"  : "Concepcion Veum",
      "group" : "Бухгалтерия"
    }, { "name" : "Xzavier Effertz", "group" : "Проектный отдел" }, { "name" : "Ibrahim Kohler", "group" : "Проектный отдел" }, {
      "name"  : "Taurean Rice",
      "group" : "Бухгалтерия"
    }, { "name" : "Benton Kozey" }, { "name" : "Gaston Ebert", "group" : "Отдел кадров" }, { "name" : "Kaleb Hessel", "group" : "Бухгалтерия" }, {
      "name"  : "Alyce Feest",
      "group" : "Бухгалтерия"
    }, { "name" : "Fanny Harris", "group" : "Проектный отдел" }, { "name" : "Ursula Mann", "group" : "Проектный отдел" }, {
      "name"  : "Ruth Larkin",
      "group" : "Бухгалтерия"
    }, { "name" : "Felix Weimann", "group" : "Проектный отдел" }, { "name" : "Estefania Halvorson", "group" : "Проектный отдел" }, {
      "name"  : "Elinore Will",
      "group" : "Проектный отдел"
    }, { "name" : "Hal Hilpert", "group" : "Бухгалтерия" }, { "name" : "Jarred Brekke", "group" : "Бухгалтерия" }, {
      "name"  : "Sonny Gleason",
      "group" : "Руководство"
    }, { "name" : "Danny Mayert", "group" : "Руководство" }, { "name" : "Nickolas Spinka", "group" : "Бухгалтерия" }, { "name" : "Aisha Purdy" }, {
      "name"  : "Filiberto Lemke",
      "group" : "Проектный отдел"
    }, { "name" : "Lorenzo Gorczany", "group" : "Отдел кадров" }, { "name" : "Jaclyn Considine", "group" : "Проектный отдел" }, {
      "name"  : "Vivian Leannon",
      "group" : "Отдел кадров"
    }, { "name" : "Graham Kassulke" }, { "name" : "Ken Flatley", "group" : "Руководство" }, { "name" : "Delmer Goldner", "group" : "Отдел кадров" }, {
      "name"  : "Rita Johns",
      "group" : "Руководство"
    }, { "name" : "Kristin Wolf", "group" : "Руководство" }, { "name" : "Cortez Gerhold", "group" : "Проектный отдел" }, {
      "name"  : "Halle Prohaska",
      "group" : "Бухгалтерия"
    }, { "name" : "Elwyn Cronin", "group" : "Отдел кадров" }, { "name" : "Whitney Christiansen", "group" : "Бухгалтерия" }, {
      "name"  : "Eveline Lebsack",
      "group" : "Отдел кадров"
    }, { "name" : "Jimmy Kulas", "group" : "Отдел кадров" }, { "name" : "Celestine Wilkinson", "group" : "Бухгалтерия" }, {
      "name"  : "Elyssa Boyle",
      "group" : "Проектный отдел"
    }, { "name" : "Buford Runolfsson", "group" : "Проектный отдел" }, { "name" : "Catharine Zemlak", "group" : "Проектный отдел" }, {
      "name"  : "Chelsey Rutherford",
      "group" : "Проектный отдел"
    }, { "name" : "Creola Padberg", "group" : "Отдел кадров" }, { "name" : "Travon Stracke", "group" : "Проектный отдел" }, {
      "name"  : "Griffin Keebler",
      "group" : "Проектный отдел"
    }, { "name" : "Luz Mraz", "group" : "Руководство" }, { "name" : "Brant Brown" }, { "name" : "Tevin Wintheiser", "group" : "Отдел кадров" }, {
      "name"  : "Alessandro Lebsack",
      "group" : "Бухгалтерия"
    }, { "name" : "Emile Brekke", "group" : "Бухгалтерия" }, { "name" : "Eduardo Hartmann", "group" : "Руководство" }, {
      "name"  : "Mellie Considine",
      "group" : "Отдел кадров"
    }, { "name" : "Pasquale Dietrich", "group" : "Отдел кадров" }, { "name" : "Toby Rolfson", "group" : "Руководство" }, { "name" : "Davon Morar" }, {
      "name"  : "Shaylee Stanton",
      "group" : "Руководство"
    }, { "name" : "Martin Davis", "group" : "Проектный отдел" }, { "name" : "Ludie Mraz", "group" : "Отдел кадров" }, {
      "name"  : "Carley Wisozk",
      "group" : "Отдел кадров"
    }, { "name" : "Julianne King", "group" : "Руководство" }, { "name" : "Johnathon Mohr", "group" : "Отдел кадров" }, { "name" : "Jules Collier" }, {
      "name"  : "Alisha Koelpin",
      "group" : "Руководство"
    }, { "name" : "Adrienne Klein", "group" : "Бухгалтерия" }, { "name" : "Kylie Skiles", "group" : "Бухгалтерия" }, {
      "name"  : "Kiarra Turcotte",
      "group" : "Руководство"
    }, { "name" : "Tyrell Swift", "group" : "Отдел кадров" }, { "name" : "Tamia Gerhold", "group" : "Отдел кадров" }, {
      "name"  : "Idell Hilpert",
      "group" : "Проектный отдел"
    }, { "name" : "Mohammed Heathcote", "group" : "Проектный отдел" }, { "name" : "Gerard Abbott", "group" : "Бухгалтерия" }, {
      "name"  : "Kara Schmeler",
      "group" : "Бухгалтерия"
    }, { "name" : "Amalia Gerhold", "group" : "Отдел кадров" }, {
      "name"  : "Noe Hartmann",
      "group" : "Отдел кадров"
    }, { "name" : "Wilfredo Stoltenberg" }, {
      "name"  : "Gabriella Pfeffer",
      "group" : "Проектный отдел"
    }, { "name" : "Coy Witting" }, { "name" : "Elmer Welch" }, { "name" : "Loy Rohan", "group" : "Проектный отдел" }, { "name" : "Rosina Ortiz" }, {
      "name"  : "Arch Bashirian",
      "group" : "Руководство"
    }, { "name" : "Eulah Dach", "group" : "Руководство" }, { "name" : "Esteban McDermott", "group" : "Отдел кадров" }, {
      "name"  : "Annamae Pfannerstill",
      "group" : "Бухгалтерия"
    }, { "name" : "Makenna Kling", "group" : "Проектный отдел" }, { "name" : "Era Gaylord", "group" : "Бухгалтерия" }, {
      "name"  : "Justice Shanahan",
      "group" : "Проектный отдел"
    }, { "name" : "Buck Weber", "group" : "Отдел кадров" }, { "name" : "Clint Nikolaus", "group" : "Проектный отдел" }, { "name" : "Jacinto Hoeger" }, {
      "name"  : "Paris Cummings",
      "group" : "Отдел кадров"
    }, { "name" : "Robyn Bernhard", "group" : "Бухгалтерия" }, { "name" : "Heaven Conroy", "group" : "Бухгалтерия" }, {
      "name"  : "Abagail Lueilwitz",
      "group" : "Отдел кадров"
    }, { "name" : "Jodie Lakin", "group" : "Бухгалтерия" }, { "name" : "Desiree Schimmel", "group" : "Проектный отдел" }, {
      "name"  : "Genesis Morar",
      "group" : "Отдел кадров"
    }, { "name" : "Antonina Glover", "group" : "Проектный отдел" }, { "name" : "Bernardo Bauch", "group" : "Проектный отдел" }, {
      "name"  : "Quincy Rutherford",
      "group" : "Проектный отдел"
    }, { "name" : "Earl King", "group" : "Проектный отдел" }, { "name" : "Gustave Baumbach", "group" : "Отдел кадров" }, {
      "name"  : "Jaden O'Reilly",
      "group" : "Руководство"
    }, { "name" : "Raymond Conn", "group" : "Бухгалтерия" }, { "name" : "Monty Denesik" }, { "name" : "Rosalia Roberts", "group" : "Бухгалтерия" }, {
      "name"  : "Patrick Gorczany",
      "group" : "Отдел кадров"
    }, { "name" : "Katharina Thiel", "group" : "Проектный отдел" }, { "name" : "Rosella Shields", "group" : "Бухгалтерия" }, {
      "name"  : "Judson Hintz",
      "group" : "Отдел кадров"
    }, { "name" : "Courtney Marks", "group" : "Бухгалтерия" }, { "name" : "Catharine Leannon", "group" : "Бухгалтерия" }, {
      "name"  : "Sabryna Bednar",
      "group" : "Проектный отдел"
    }, { "name" : "Khalid Parker", "group" : "Бухгалтерия" }, { "name" : "Camron Johnston", "group" : "Бухгалтерия" }, { "name" : "Kenya Rath", "group" : "Руководство" }
  ];

  cities = ["47 км", "81 км М-10", "Абаза", "Абакан", "Абалак", "Абашево", "Абдаево", "Абзаково", "Абрамцево", "Абрау-Дюрсо", "Авдотьино", "Авдотьино", "Авдулово-1", "Авчурино", "Агломазово", "Агрыз", "Адербиевка", "Адлер", "Адыгейск", "Адык", "Азов", "Акатово", "Аксай", "Аксаково", "Аксарайский", "Акташ", "Акулево", "Акулова Гора", "Алакаевка", "Алапаевск", "Алатырь", "Александров", "Александровка", "Александровка", "Александровское", "Алексеевка", "Алексеевка", "Алексеевское", "Алексиковский", "Алексин", "Алеховщина", "Алешино (Пушкинский р-н)", "Алешково", "Алешня", "Алешунино", "Алмазово", "Алнаши", "Алтун", "Алтухово", "Алтынжар", "Алупка", "Алушта", "Альметьевск", "Анапа", "Анастасово", "Анатольевка", "Ангарск", "Андомский Погост", "Андреевка", "Андреевское", "Андрианово", "Анишино", "Анна", "Аннино", "Антропово", "Антушково", "Апатиты", "Апсарёвское урочище", "Арамашево", "Арамиль", "Аргун", "Ардатов", "Арженка", "Арзамас", "Аркаим", "Армавир", "Армянск", "Арсаки", "Арск", "Арское", "Архангельск", "Архангельское", "Архангельское", "Архипо-Осиповка", "Архыз", "Аршан", "Асбест", "Аскиз", "Асташево", "Астрахань", "Астрача", "Аткарск", "Аушигер", "Афанасово", "Ахлебинино", "Ахтубинск", "Ахуны", "Ачаир", "Ачинск", "Аша", "Ая", "Бабаево", "Бабугент", "Багратионовск", "Баево", "Баево", "Байкал", "Баклань", "Балабаново", "Балаково", "Баланово", "Балахна", "Балашиха", "Балашутино", "Балезино", "Баловнево", "Балтийск", "Балыкино", "Балыктуюль", "Барвиха", "Барнаул", "Барсуково", "Барятино", "Баскаково", "Батурино", "Батурино", "Батыево", "Батырево", "Бахмары", "Бахмутово", "Бахчиванджи", "Бахчисарай", "Бачкеево", "Баштановка", "Бежаницы", "Бежецк", "Беково", "Белая Гора", "Белая Горка", "Белая Калитва", "Белая Холуница", "Белбаж", "Белгород", "Белев", "Белейка", "Белинский", "Белово", "Белогорка", "Белогорск", "Белогорье", "Белозерный", "Белозерск", "Беломорск", "Белоомут", "Белорецк", "Белоярское", "Белые Берега", "Белый Бом", "Белый Колодезь", "Белый Колодец", "Белый Раст", "Бельское", "Бергамак", "Бережная Дуброва", "Березник", "Березник", "Березники", "Березовка", "Березовка", "Берёзовка", "Берёзовский", "Берново", "Беседино", "Бессоновка", "Бийск", "Билимбай", "Билярск", "Биробиджан", "Боблово", "Бобрик", "Бобров", "Бобровы Дворы", "Богданово-Витово", "Богимово", "Боговское", "Боголюбово", "Богородицк", "Богородск", "Богородское", "Богородское", "Богородское (Рузский р-он)", "Богословка", "Богучар", "Боковая", "Боксон", "Болгар", "Болдино", "Болдыревка", "Бологое", "Болонь", "Болхов", "Большая Алешня", "Большая Валяевка", "Большая речка", "Большая Сундырь", "Большая Чепца", "Большая Шалга", "Большекулачье", "Большеречье", "Большие Бакалды", "Большие Белыничи", "Большие Всегодичи", "Большие Вязёмы", "Большие Гари", "Большие Рымы", "Большие Сибы", "Большие Уки", "Большие Харлуши", "Большое Болдино", "Большое Заречье", "Большое Козино", "Большое Кропотово", "Большое Лыково", "Большое Ремонтное", "Большое Самарино", "Большое Федоровское", "Большое Шигаево", "Большой Бабинский", "Большой Вьяс", "Большой Могой", "Большой Утриш", "Бор", "Боргустанская", "Борец", "Борисовка", "Борисово", "Борисовское", "Борисоглеб (Судогодский р-он)", "Борисоглебск", "Борисоглебский", "Борки", "Борки", "Борки", "Борнуково", "Боровенск", "Боровиково", "Боровичи", "Боровичи", "Боровно", "Боровое", "Боровск", "Боровское", "Бородино", "Борок", "Борок", "Бортнево", "Братково", "Братск", "Бредихино", "Бредихино", "Брейтово", "Бронницы", "Бросно", "Брусничное", "Брыкин Бор", "Брынчаги", "Брянск", "Бугор", "Бугульма", "Буденновск", "Будённовская", "Будогощь", "Буинск", "Буй", "Булашово", "Бураново", "Бурдово", "Бурдугуз", "Бурсоль", "Бытошь", "Вагай", "Вад", "Валаам", "Валдай", "Валищево", "Валуево", "Валуйки", "Варениковская", "Варзуга", "Варна", "Василевка", "Василево", "Василево (Переславский р-н)", "Васильево (Палкинский р-н)", "Васильевский мох", "Васильевское", "Васино", "Ватутино", "Вахонино", "Вахрушев", "Введенская слобода", "Введеньё", "Ведлозеро", "Велиж", "Великая Губа", "Великая Топаль", "Великие Луки", "Великий Новгород", "Великий Устюг", "Великое", "Великомихайловка", "Великорецкое", "Вельдеманово", "Вельск", "Венёв", "Венев Монастырь", "Вербилки", "Верево", "Верея", "Верзилово", "Вернадовка", "Вертково", "Верх-Нейвинский", "Верхнаяя Мара", "Верхне-Никульское", "Верхнебаканский", "Верхнее Заозерье", "Верхнее Мячково", "Верхнетуломский", "Верхнеуральск", "Верхнечусовские Городки", "Верхние Ачаки", "Верхний Ларс", "Верхний Уймон", "Верхняя Кутузовка", "Верхняя Пышма", "Верхняя Санарка", "Верхняя Синячиха", "Верхняя Троица", "Верхотурье", "Веселовка", "Весёлое", "Весь", "Весьегонск", "Ветвеник", "Ветлуга", "Ветошкино", "Вешаловка", "Вёшенская", "Взморье", "Видлица", "Видное", "Вилегодск", "Винновка", "Виноградный", "Виноградово", "Висим", "Висимо-Уткинск", "Вичуга", "Владивосток", "Владикавказ", "Владимир", "Владимировка", "Владимировка (Енотаевский р-он)", "Владимирово", "Владимирское", "Власиха", "Власово", "Вознесенское", "Вознесенье", "Вознесенье", "Возрождение", "Вокнаволок", "Волговерховье", "Волгово", "Волгоград", "Волгодонск", "Волгореченск", "Волженец", "Волжский", "Волковицы", "Волконка", "Вологда", "Володарск", "Володарское", "Володкино", "Волоколамск", "Волосово", "Волосово", "Волосово", "Волочаевка", "Волочаевка 1-я", "Волхов", "Волынщино", "Вольск", "Воробьево", "Воробьи", "Воронеж", "Воронино", "Вороново", "Воронцово", "Ворсма", "Ворша", "Воскресенск", "Воскресенская Слободка", "Воткинск", "Врази-Ятчи", "Всеволожск", "Всходы", "Выбити", "Выборг", "Выбуты", "Выгоничи", "Выдропужск", "Выезжий Лог", "Выкса", "Выползово", "Выползово", "Выползово", "Выра", "Вырица", "Высоково", "Высокое", "Высокое", "Высоцк", "Вытегра", "Выша", "Вышегор", "Вышестеблиевская", "Вышний Волочек", "Вяз", "Вязники", "Вязье(Дедовичский район)", "Вязьма", "Вяртсиля", "Вятские Поляны", "Вятское", "Гаврилов Посад", "Гаврилов-Ям", "Гаврилова Гора", "Гагарин", "Гагарино 1-е", "Гагино", "Газопровод", "Гай-Кодзор", "Галибиха", "Галица", "Галич", "Галкино", "Гарусово", "Гатчина", "Гвардейск", "Гвардейское", "Гверстянка", "Гдов", "Геленджик", "Генеральское", "Генеральщино", "Георгиевск", "Гжель", "Гимрека", "Гирвас", "Глазов", "Глебово", "Глебово Городище", "Глебовское", "Глобицы", "Годёново", "Гололобово", "Голочелово", "Голубино", "Голубицкая", "Голунь", "Голынки", "Голышманово", "Гора Соколиха", "Горбенки", "Горелое", "Горетово", "Горинское", "Горицы", "Горки", "Горки (Коломенский р-н)", "Горки Ленинские", "Горналь", "Горно-Алтайск", "Горнозаводск", "Горный", "Городец", "Городище", "Городище", "Городня", "Городовиковск", "Горожанка", "Гороховец", "Гороховка", "Горы", "Горы", "Горячие Ключи", "Горячий Ключ", "Госзаповедник", "Гостилицы", "Грабово", "Градницы", "Грайвороны", "Гремячево", "Гремячево", "Гремячее", "Гремячий", "Гремячинск", "Гречихино", "Грибаново", "Грибное", "Грибоедово", "Григорово", "Гридино", "Грозный", "Грузино", "Грумант", "Грязовец", "Гуамка", "Губаха", "Губкин", "Гуево", "Гузерипль", "Гуково", "Гурьевск", "Гурьевск", "Гусев", "Гусь-Железный", "Гусь-Хрустальный", "Давыдово", "Давыдово (Калининский район)", "Дагомыс", "Далматово", "Данилов", "Даниловка", "Данилово", "Данилово", "Данилово (Павлово-Посадский р-он)", "Данки", "Данков", "Даньково", "Дарна", "Даровое", "Даховская", "Дворики (Камешковский р-н)", "Дворкино", "Дворяниново", "Дебёсы", "Деболовское", "Девица", "Деденево", "Дедилово", "Дединово", "Дедово", "Демидов", "Демино", "Демянск", "Денисово", "Дербент", "Десна-Буревестник", "Детчино", "Джанкой", "Джанхот", "Джубга", "Дзержинск", "Дзержинский", "Дивеево", "Дивная Гора", "Дивногорск", "Дивногорье", "Дивноморское", "Дивово", "Диево Городище", "Димитровград", "Дмитриев-Льговский", "Дмитров", "Дмитровск-Орловский", "Дмитровский Погост", "Доброе", "Добрунь", "Добрянка", "Доваторовка", "Долгая Поляна", "Долгомостье", "Долгоруково", "Должанская", "Долматово", "Домбай", "Домнино", "Домново", "Домодедово", "Донское", "Донской", "Дорогобуж", "Дракино", "Дровнино", "Дрожжино", "Дружба", "Дубна", "Дубна", "Дубовка", "Дубосеково", "Дубровка", "Дубровка", "Дубровка", "Дубровное", "Дунилово", "Дунино", "Дурнятская котловина", "Дутшево", "Душатино", "Душоново", "Дылицы", "Дымково", "Дюртюли", "Дятьково", "Евпатория", "Егла", "Егорьевск", "Едрово", "Ежово", "Ейск", "Екатеринбург", "Екимцево", "Елабуга", "Еланская", "Еланцы", "Елец", "Елизаветинка", "Елизаветинка (Мценский район)", "Елизарово", "Елизово", "Елино", "Ело (Онгудайский р-н)", "Елохово", "Елшанка", "Елшанка", "Ельня", "Еманжелинск", "Ембаево", "Емецк", "Емишево", "Епифань", "Ерахтур", "Еремейцево", "Ерлино", "Ермаки", "Ермаково", "Ермолино", "Ермолино", "Ерохина", "Ершевская", "Ессентуки", "Ефимьево", "Ефремов", "Жадовка", "Желанное", "Железноводск", "Железногорск", "Железнодорожный", "Железнодорожный", "Жемчуг", "Жемчужниково", "Жерехово", "Жестылево", "Жигулёвск", "Жидилов Бор", "Жиздра", "Жирятино", "Жонино", "Жостово", "Жудрё", "Жуков", "Жуково", "Жуковский", "Жуланово", "За Родину", "Заборово", "Заборье", "Завиваловка", "Завидово", "Завод Михайловский", "Заволжск", "Заволжье", "Завражье", "Задонск", "Зайцева Гора", "Залесное", "Залесье", "Замьяны", "Заозерье", "Заокский", "Западная Двина", "Зарайск", "Заречный", "Заречье", "Заречье", "Зарубинки", "Зарубино", "Заручье", "Заря", "Затишье", "Захарово", "Захоломье", "Зачачье", "Звездный", "Звездный городок", "Звенигород", "Звериноголовское", "Зеленец", "Зеленоборский", "Зеленогорск", "Зеленоград", "Зеленоградск", "Зеленчукская", "Зеленый Берег", "Зеленый город", "Зеленый Шум", "Землино", "Зикеево", "Зимарово", "Зимницы", "Златоуст", "Злынь", "Змеиногорск", "Знаменка", "Знаменск", "Знаменск", "Знаменское", "Золотарёвка", "Золотой", "Золотухино", "Зольное", "Зубрилово", "Зубцов", "Зуево (Вашкинский р-н)", "Зуевы Ключи", "Зура", "Ибердский", "Ибреси", "Ивангород", "Иваниши", "Ивановка", "Ивановка", "Ивановка", "Иваново", "Ивановская", "Ивановское", "Ивановское", "Ивантеевка", "Ивантеевка", "Иванчуг", "Ивашково", "Ивашково", "Ивдель", "Ивот", "Игарка", "Игнойла", "Игра", "Ижевск", "Ижевское", "Избербаш", "Изборск", "Изварино (153 км М4)", "Известковый", "Измайлово", "Изобильное", "Икряное", "Икша", "Илешево", "Иловля", "Ильжо", "Ильина Гора", "Ильинский", "Ильинский погост", "Ильинско-Подомское", "Ильинское", "Ильинское", "Ильинское", "Ильинское (Козельский район)", "Ильинское (Малопургинский р-н)", "Ильинское (Малоярославецкий р-н)", "Ильичево", "Инема", "Инжавино", "Инза", "Инзер", "Инкерман", "Инсар", "Интерпосёлок", "Иня", "Ипатово", "Ирбит", "Иргизлы", "Иркутск", "Исады", "Исаково", "Исеть", "Исилькуль", "Искитим", "Иссад", "Истобенск", "Истра", "Ичалки", "Ишим", "Июльское", "Йошкар-Ола", "Кабардинка", "Каблуково", "Кага", "Кадников", "Кадом", "Кадуй", "Кадышевка", "Казаково", "Казановка", "Казань", "Казахский аул", "Казачий брод", "Казиловка", "Каипы", "Калач", "Калачинск", "Калевала", "Калининград", "Калиновка (Красносулинский р-он)", "Калуга", "Калязин", "Камбарка", "Камгорт", "Каменка", "Каменка", "Каменка (Выборгский р-н)", "Каменка (Красноармейский р-н)", "Каменка (Любытинский р-н)", "Каменное Заделье", "Каменномостский", "Каменск-Уральский", "Каменск-Шахтинский", "Каменское", "Каменское", "Каменское (Черняховский р-н)", "Камлак", "Камызяк", "Камышин", "Камышлов", "Канадей", "Канаш", "Кандалакша", "Карабаш", "Карагай", "Карайчевка", "Карамышево", "Карандаково", "Карачаевск", "Карачев", "Каргашино", "Каргинская", "Каргополь", "Карпинск", "Карповка", "Карпово", "Карпысак", "Каршевитое", "Каршево", "Касимов", "Касли", "Каспийск", "Катав-Ивановск", "Качканар", "Кашин", "Кашинка(Цильнинский р-н)", "Кашино", "Кашира", "Каширское", "Кемерово", "Кемь", "Кенозерский национальный парк", "Керро", "Керчь", "Кестым", "Кетченеры", "Кидекша", "Кизильское", "Кикерино", "Кикино (Дмитровский р-он)", "Килимово", "Кимжа", "Кимовск", "Кимры", "Кингисепп", "Кинешма", "Киреевск", "Киржач", "Киржач (Покровский район)", "Кириллов", "Кирицы", "Киров", "Кировец", "Кирово-Чепецк", "Кировск", "Кировский", "Кировский", "Кисловодск", "Кичменгский городок", "Кишкино", "Киясово", "Киясово", "Клементьево", "Кленовая гора", "Климов завод", "Климовка", "Климово", "Климово", "Клин", "Клинцы", "Клусеево", "Клыково", "Ключевка", "Княжиха", "Князево", "Кобрино", "Ковалево", "Ковернино", "Ковров", "Коелга", "Коза", "Козелкино", "Козельск", "Козловка", "Козлово", "Козьмодемьянск", "Коккорево", "Кокрять", "Коктебель", "Кокшайск", "Кола", "Колбеки", "Колежма", "Коленцы", "Кологрив", "Колокола (Крестцовский р-н)", "Коломна", "Коломно", "Колоцкое", "Колпино", "Колчаново", "Колывань", "Кольчугино", "Колюбакино", "Колюды", "Комсомольск-на-Амуре", "Комсомольский", "Комсомольский", "Комягино", "Конаково", "Конвейер", "Кондаково", "Кондопога", "Кондрово", "Конезаводский", "Конный", "Константиново", "Кончанско-Суворовское", "Конь-Колодезь", "Копановка", "Копорье", "Коприно", "Коптелово", "Копьево", "Коркино", "Коркмаскала", "Коробовка", "Коровье", "Королёв", "Королятино", "Коромыслово", "Коростынь", "Коротояк", "Короча", "Корпово", "Коршево", "Коряжма", "Косилово", "Космачево", "Космозеро", "Костёнки", "Костино", "Костомарово", "Костомукша", "Кострома", "Костылева", "Костыши", "Коськово", "Котелино", "Котельники", "Котельнич", "Коткишево", "Котлас", "Коуровка", "Кочемирово", "Кочкурово", "Кош-Агач", "Кошурниково", "Краинка", "Крапивна", "Красная Горка", "Красная Горка", "Красная Заря", "Красная Ляга", "Красная поляна", "Красноармейск", "Красноборск", "Красновидово", "Красновишерск", "Красногорка", "Красногорск", "Красногорская", "Красногорский", "Красногорский", "Краснодар", "Красное", "Красное (Орехово-Зуевский р-н)", "Красное (Старицкий р-н)", "Красное Поле", "Красное Село", "Красное-на-Волге", "Краснозаводск", "Краснокамск", "Краснолесный", "Краснополец", "Краснослободск", "Краснотурьинск", "Красноусольский", "Красноуфимск", "Краснофлотск", "Красноярск", "Красные Четаи", "Красный Броневик", "Красный Восход", "Красный Ключ", "Красный Партизан", "Красный Профинтерн", "Красный Рог", "Красный Сокол", "Красный Уралец", "Красный Холм", "Красный Холм", "Красный Яр", "Кремёнки", "Крестцы", "Крестцы", "Кривандино", "Кривель", "Кривой порог", "Кронштадт", "Кропоткин", "Кружилин", "Крутой Верх", "Крутоярский", "Крыпецкое", "Кстинино", "Кстово", "Кубинка-1", "Кувака", "Кувшиново", "Кугаева", "Кугеси", "Кудрино", "Кудымкар", "Кузебаево", "Кузнецк", "Кузнецово", "Кузнецы", "Кузовка", "Кузомень", "Кузьменки", "Кузьминское", "Кузяево", "Куйбышев", "Кукобой", "Кулебаки", "Кулига", "Кулики", "Кунашак", "Кунгур", "Купчегень", "Курагино", "Куракино", "Курба", "Курган", "Курганово", "Куркиеки", "Куркино", "Куровское", "Курорт Озеро Медвежье", "Курортное", "Курск", "Куртяево", "Курчатов", "Курьково", "Кучино (Чусовской р-н)", "Кушалино", "Кушва", "Кущевская", "Кшауши", "Кызыл", "Кын (село)", "Кырен", "Кыштым", "Кюрегаси", "Лабинск", "Лаврентьевское", "Лагань", "Лаго-Наки", "Ладва (Подпорожский район)", "Ладожино", "Ладушкин", "Лазаревское", "Лазарцево", "Лаишево", "Лакинск", "Лакомая Буда", "Ларионово", "Ласково", "Лахденпохья", "Лая", "Лебедянь", "Лебяжье", "Лев Толстой", "Легостаево", "Лежнево", "Ленино-Кокушкино", "Ленинск-Кузнецкий", "Леоново", "Леохново", "Лермонтово", "Лесная", "Лесниково", "Лесное Конобеево", "Лесной (Зеленоградский р-н)", "Летнево", "Ливадия", "Ливны", "Ликино-Дулево", "Лиман", "Липецк", "Липин Бор", "Липки", "Липна", "Лиски", "Лиственка", "Листвянка", "Лихославль", "Лобня", "Ловозеро", "Лодейное Поле", "Лоймола", "Локня", "Локоть", "Ломовка", "Ломоносов", "Ломоносово", "Лоо", "Лопатино", "Лосево", "Лосино-Петровский", "Лоухи", "Лох", "Луга", "Луги", "Лужки", "Лужки", "Луза", "Лукино", "Лукино(Богородский р-н)", "Лукьянцево", "Лунино", "Лунино", "Лункино", "Лух", "Луховицы", "Лызлово", "Лыкошино", "Лысково", "Лысьва", "Лыткарино", "Льва Толстого", "Львово", "Львы", "Льгов", "Любаново", "Любань", "Любенск", "Люберцы", "Любим", "Любытино", "Люговичи", "Людиново", "Лядины", "Ляличи", "Лянгасово", "Ляскеля", "Ляхово", "Магнитогорск", "Магри", "Маево", "Мазунино", "Майкоп", "Макарово", "Макарьев", "Макарьево", "Маклаково", "Максатиха", "Малая Гверстонь", "Малая Дубна", "Малая Пурга", "Малая Садовка (Сосновоборский р-н)", "Малетино", "Малинники", "Малиновое озеро", "Малмыж", "Малоперекопное", "Малореченское", "Малоярославец", "Малы", "Малые Карелы", "Малый Арал", "Малый Борок", "Малый Кармыж", "Мамоново", "Мамонтово", "Манжерок", "Мантурово", "Манц", "Маньга", "Мариинск", "Мариинский посад", "Маринино", "Марково", "Маркс", "Мармыжи", "Мартыново", "Марфино", "Марфино", "Марциальные воды", "Марьинка", "Марьино", "Маслянный Мыс", "Матвеево", "Матвеевское", "Матвейково", "Матросы", "Махалино", "Махачкала", "Махра", "Мацеста", "Мглин", "Меглецы", "Медведки", "Медвежьегорск", "Меденицино", "Медное", "Медынь", "Медяны", "Межениновка", "Мезмай", "Меленки", "Мелетово", "Мелихово", "Мельниково", "Мензелинск", "Меньшаковская", "Меркушино", "Мещерино", "Мещерское", "Мещерское (Сердобский р-он)", "Мещовск", "Миасс", "Мигулинская", "Микляиха", "Микулино", "Микулино", "Миллерово", "Милославское", "Милотичи", "Минеральные воды", "Минусинск", "Мироновка", "Михайлов", "Михайловка", "Михайловка", "Михайловка", "Михайловская слобода", "Михайловский перевал", "Мичуринск", "Могилевка", "Можайск", "Можга", "Мозгово", "Мокшан", "Молдино", "Молдовановка", "Молебка", "Монастырщина", "Монастырь", "Монастырь (Холмогорский р-н)", "Монды", "Монино", "Мончегорск", "Мордово", "Морозовицы", "Моршанск", "Мосальск", "Москва", "Моховое", "Мошонки", "Мраморное", "Мраморское", "Мстера", "Мстихино", "Мувыр", "Мугай", "Муравлёво", "Муранка", "Мураново", "Муратово", "Мурманск", "Муром", "Муромцево", "Мценск", "Мшенцы", "Мымрино", "Мытищи", "Мытники", "Мышкин", "Мясной Бор", "Мятлево", "Набережные Челны", "Наволок", "Нагово", "Нагорный Иштан", "Нагорье", "Надовражино", "Нальчик", "Нариманов", "Наро-Фоминск", "Наровчат", "Нарышкино", "Нарышкино", "Насва", "Наследницкий", "Наумово", "Научный", "Нахабино", "Находка", "Неберджаевская", "Небылое", "Невель", "Неверово", "Невьянск", "Недвиговка", "Неёлово", "Некоуз", "Некрасовка", "Некрасово", "Некрасово", "Некрасовское", "Нелазское", "Неман", "Немчинова Гора", "Непецино", "Нерехта", "Нероново", "Нескучное", "Нестерово", "Нефтекамск", "Нечаевка", "Нея", "Нижнекамск", "Нижнеудинск", "Нижние Серги", "Нижние Ураспуги", "Нижний Архыз", "Нижний Баскунчак", "Нижний Ломов", "Нижний Новгород", "Нижний Тагил", "Нижний Чегем", "Нижняя Добринка", "Нижняя Пыхта", "Нижняя Синячиха", "Нижняя Тура", "Низовье", "Никель (не жил.)", "Никита", "Никола-Ленивец", "Николаевка", "Николаевка", "Николо-Гастунь", "Николо-Корма", "Николо-Урюпино", "Николо-Ширь", "Никольск", "Никольск", "Никольск", "Никольское", "Никольское", "Никольское", "Никольское (Рузский р-н)", "Никольское(Жуковский р-н)", "Никулино", "Никульское", "Новая", "Новая Беденьга", "Новая Ладога", "Новая Титовка", "Новая Ура", "Новая Усмань", "Новиково", "Новинки", "Новоаннинский", "Новобайрамгулово", "Новобобровское", "Новое (Переславский р-н)", "Новоживотинное", "Новозыбков", "Новоивановское", "Новокузнецк", "Новомихайловский", "Новомосковск", "Новоржев", "Новороссийск", "Новоселки (Чеховский район)", "Новоселово", "Новосибирск", "Новосиль", "Новосокольники", "Новоспасское", "Новотомниково", "Новотроицк", "Новотроицкое", "Новохаритоново", "Новочебоксарск", "Новочеркасск", "Новошино", "Новые Ельцы", "Новые Маклауши", "Новый Березай", "Новый Быт", "Новый Кырлай", "Новый Оскол", "Новый Свет", "Ногинск", "Ножкино", "Норбужье", "Норильск", "Норья", "Ноябрьск", "Нынек", "Ныроб", "Нытва", "Нюксеница", "Обнинск", "Обоянь", "Овстуг", "Овсянка", "Одинцово", "Одоев", "Оёк", "Ожерелки", "Озерецкое", "Озерки", "Озеро Булухта", "Озёры", "Оковцы", "Октябрьский", "Октябрьский", "Октябрьский", "Окуловка", "Оленегорск", "Олонец", "Ольгинка", "Ольгово", "Ольховка", "Омск", "Омутнинск", "Онгудай", "Онега", "Опеченский посад", "Опоки", "Опочка", "Оранки", "Орда", "Орёл", "Оренбург", "Ореховно", "Орехово", "Орехово", "Орехово-Зуево", "Орск", "Орша", "Оса", "Осеченки", "Осино-Гай", "Осиновец", "Ослинка", "Осташево", "Осташков", "Остров", "Остров", "Островно", "Островское", "Острогожск", "Отрадинский", "Охотино", "Охотино(Переславский район)", "Охотничье", "Очёр", "Оять", "Павлищев бор", "Павлово", "Павлово на Оке", "Павловск", "Павловск", "Павловская слобода", "Павловский", "Павловский Посад", "Павловское", "Пады", "Палех", "Палласовка", "Паника", "Папоротка", "Паратунка", "Париж", "Паробоч", "Парфеньево", "Пачеболка", "Пенза", "Пенкино", "Пено", "Пепкино", "Первитино", "Первомайск", "Первомайский", "Первоуральск", "Первый Воин", "Перевлес", "Перевоз", "Перевозное", "Переволоки", "Передел", "Переделкино", "Перелески (Переславский р-н)", "Перемышль", "Пересвет", "Переславль-Залесский", "Пермогорье", "Пермь", "Пески", "Песочное", "Пестово", "Пёт", "Петелино", "Петергоф", "Петрищево", "Петрово-Дальнее", "Петровская (Шенкурский р-н)", "Петровский", "Петровское", "Петровское", "Петровское", "Петрозаводск", "Петропавловка", "Петропавловск-Камчатский", "Петропавловское", "Петрушино", "Петухово", "Петухово", "Петушки", "Печоры", "Пешелань", "Пешково", "Пивкино", "Пинаевы Горки", "Пинега", "Пионерский", "Пионерское", "Пироговка", "Писцово", "Питкяранта", "Пихтовое", "Пичаево", "Пищалкино", "Плавск", "План", "Пластуновская", "Плес", "Плоское(Лужский р-н)", "Плоскошь", "Плотицино", "Плюсково", "Победа", "Повенец", "Поворот на Сегежу", "Погар", "Погорелово", "Погорелово", "Погост (Каргопольский р-н)", "Погост (Ратонаволок) Холмогорский р-н", "Погранкондуши", "Подвязье", "Подгородка", "Подгороднее", "Подгоры", "Поддубки", "Подкопаево", "Подлесная Тавла", "Подлесный", "Подмоклово", "Подолец", "Подольск", "Подомо (Вилегодский р-н)", "Подпорожье", "Подчервино", "Подъяблонье", "Подъячево", "Пожня", "Поим", "Покров", "Покровка", "Покровское", "Покровское", "Покровское", "Полазна", "Полевской", "Полесск", "Полибино", "Полибино", "Поливаново", "Полковниково", "Полом", "Полотняный завод", "Полушкино", "Поляково", "Полярные Зори", "Понизовка", "Порецкое", "Поречье", "Поречье (Калязинский р-н)", "Поречье-Рыбное", "Порхов", "Поршур", "поселок Киров", "поселок Никольской ГЭС", "Посольское", "Почеп", "Пошехонье", "Пощупово", "Поярково", "Правдинск", "Пречистое", "Пречистое", "Пржевальское", "Прибытково", "Приволжск", "Приволжский", "Приморск", "Приморск", "Приморско-Ахтарск", "Приозерск", "Приозерье", "Прислониха", "Пришиб", "Пролетарск", "Пролетарский", "Пронск", "Протасово", "Протвино", "Прохоровка", "Пряжа", "Прямухино", "Псков", "Пудож", "Пудость", "Пурех", "Пустошка", "Пустынь", "Пустынь", "Пустынь", "Пухляковский", "Пучеж", "Пушкин", "Пушкино", "Пушкинские горы", "Пущино", "Пшада", "Пыталово", "Пяльма", "Пянда", "Пяозерский", "Пятигорск", "Радищево", "Радонеж", "Радченко", "Раёк", "Разино", "Разино", "Раифа", "Райгород", "Райсеменовское", "Ракитное", "Ракоболь", "Раково", "Раменское", "Рамешки", "Рамзай", "Рамонь", "Рассказово", "Ратилово", "Рахмановка", "Ревда", "Реж", "Репино", "Реутов", "Речное", "Решма", "Ржев", "Ровное", "Рогачево", "Рогожа", "Родионово", "Родионцево", "Родниковское (Крым)", "Рождественно", "Рождествено", "Рожново", "Романово", "Ропша", "Росва", "Рославль", "Россошка", "Россошь", "Ростов Великий", "Ростов-на-Дону", "Рощинский", "Рубанщина", "Рубцовск", "Рудкино", "Рудня", "Руза", "Рузаевка", "Русиново", "Рускеала", "Русский Камешкир", "Ручьи", "Рыбачий", "Рыбинск", "Рыбницы", "Рыбное", "Рыльск", "Рюриково", "Рябово", "Ряжск", "Рязановский", "Рязанцево", "Рязань", "Рясня", "Сабурово", "Сабурово", "Саваслейка", "Саввушка", "Савеево", "Савино", "Савка", "Сагуны", "Сазанье", "Саки", "Салми", "Салтыковка", "Сальск", "Самара", "Самарское", "Самбек", "Саминский погост", "Самосделка", "Сандово", "Санкт-Петербург", "Сапожок", "Саракташ", "Саранск", "Сарапул", "Саратов", "Сартаково", "Сасово", "Сатка", "Сафоновка", "Сафоново", "Сафоново", "Свапуще", "Свердлово", "Светлогорск", "Свирица", "Свирьстрой", "Свияжск", "Свобода", "Себеж", "Севастополь", "Северодвинск", "Североуральск", "Севск", "Сегежа", "Селизово", "Селитренное", "Селище", "Селище", "Сельки", "Сельцо", "Семейка", "Семендяево", "Семенково", "Семенов", "Семеновка", "Семеновское", "Семеновское (Первомайский р-н)", "Семибратово", "Семигорье", "Семикаракорск", "Сенницы-2", "Сенной", "Сенькино", "Серафимович", "Сергиев Посад", "Сергово", "Сердобск", "Серебрянники", "Серебряное", "Середниково", "Серов", "Серпухов", "Сестрорецк", "Сибай", "Сиверский", "Сивково", "Сигово", "Сизьма", "Сикачи-Алян", "Симбилей", "Симеиз", "Симферополь", "Симы", "Синявино", "Синяя осока", "Скнятино", "Скопин", "Скородное", "Скуратово", "Славское", "Слащевская", "Слобода (Любимский район)", "Слободской", "Слюдянка", "Смеловка", "Смогири", "Смоленск", "Смоленский Шлюз", "Смолзавод", "Смольнево", "Снегири", "Собинка", "Советск", "Советск", "Созоново", "Сокол", "Соколка", "Соколовка", "Сокуры", "Соленое Займище", "Солигалич", "Соликамск", "Солнечногорск", "Солнечное", "Солнцево", "Соловки", "Соловцовка", "Соломенка", "Соломкино", "Солоники", "Солотча", "Солох-аул", "Солтаново", "Соль-Илецк", "Сольба", "Сольвычегодск", "Сольцы", "Соляное", "Сомино", "Сопыч", "Сорочий Лог", "Сортавала", "Сосновец", "Сосновый Бор", "Сосьва", "Соха", "Сочи", "Спас", "Спас-Заулок", "Спас-Клепики", "Спас-Купалище", "Спас-Смердино", "Спас-Талица", "Спасс-Косицы", "Спасск", "Спасск-Рязанский", "Спортбаза(Подольский р-н)", "Средний Икорец", "Срезнево", "Сростки", "Ставрово", "Ставрополь", "Старая Вичуга", "Старая Купавна", "Старая Ладога", "Старая Пустынь", "Старая Русса", "Старая Рязань", "Старая Ситенка", "Старая Слобода", "Старица", "Старогладовская", "Стародуб", "Старое Сандово", "Старожилово", "Старокарасук", "Старотитаровская", "Староуткинск", "Старочеркасская", "Старочернеево", "Старый Крым", "Старый Оскол", "Старый Покров", "Стенькино", "Степановка", "Степурино", "Стрелка", "Стрельна", "Ступино", "Суворов", "Судай", "Судак", "Судбищи", "Суджа", "Судиславль", "Судогда", "Суздаль", "Суйда", "Сукко", "Суксун", "Сулём", "Сумбулово", "Сундур", "Суоярви", "Сураж", "Сургут", "Сурское", "Сусанино", "Сухиничи", "Сызрань", "Сыктывкар", "Сынтул", "Сысерть", "Сычёвка", "Сямжа", "Тавда", "Таганрог", "Тайцы", "Талабские острова", "Талашкино", "Талдом", "Талеж", "Талица", "Талицы", "Талнах", "Талпаки", "Тальменка", "Тальцы", "Тамань", "Тамбов", "Тамбовка", "Тара", "Тараканово", "Тарасково", "Тарасовский", "Тарногский Городок", "Таруса", "Тарутино", "Тарханы", "Тасинский", "Татарский Саракташ", "Татинец", "Татищево", "Таширово", "Ташла", "Таштагол", "Тверь", "Творожково", "Теберда", "Тейково", "Тельма", "Тёмкино", "Темников", "Темрюк", "Тервеничи", "Тереньга", "Териберка", "Теряево", "Тетюши", "Тимашово", "Типиницы", "Титово", "Титово", "Тихая", "Тихвин", "Тихвинское (Рыбинский район)", "Тоболтура", "Тобольск", "Токсово", "Тольятти", "Томск", "Торбеево", "Торжок", "Торопец", "Торосово", "Торфяновка", "Тосно", "Тотьма", "Трехречье", "Трехселище", "Троице-Лобаново", "Троицк", "Троицк", "Троицко-Печорск", "Троицкое", "Тропарёво", "Трофимовка", "Трубчевск", "Труженик", "Трутнево", "Туапсе", "Туим", "Тула", "Тума", "Тумботино", "Туран", "Турбаза Катунь", "Тургенево", "Тургояк", "Туринск", "Туруново", "Турынгурт", "Тутаев", "Тухани", "Тучково", "Туэкта", "Тюкалинск", "Тюковка", "Тюмень", "Тюрмеровка", "Уборы", "Ува", "Уварово", "Уват", "Угледарск (станция Заозерное-Сахалинское)", "Углич", "Угодичи", "Угра", "Удельная", "Удино", "Удомля", "Удугучин", "Узей-Тукля", "Улан-Удэ", "Ульяновка", "Ульяновка", "Ульяново", "Ульяновск", "Умба", "Умет", "Умиленье", "Умрева", "Ундоры", "Унеча", "Унжа", "Уразово", "Урень", "Уржум", "Урма", "Урусово", "Урусово", "Урусово", "Уршельский", "Урюпинск", "Усмангали", "Усолье", "Усолье", "Успенское", "Усты", "Усть-Бельск", "Усть-Заостровка", "Усть-Золиха", "Усть-Кабырза", "Усть-Кан", "Усть-Каремша", "Усть-Кинельский", "Усть-Кокса", "Усть-Куда", "Усть-Ордынский", "Усть-Писаная", "Усть-Сема", "Устье", "Устюжна", "Усьва", "Утёс", "Уфа", "Ухта", "Учдере", "Учкекен", "Учма", "Ушаково", "Ушаково(Хайлигенвальде)", "Ушково", "Фадеево", "Фатеж", "Фатьяново", "Фаустово", "Федоровка", "Федоскино", "Федурино", "Феодосия", "Феофилова Пустынь", "Ферапонтово", "Ферзиково", "Фершампенуаз", "Филимонки", "Филипповское", "Филипповское (Кантауровский с", "Фоки", "Фокино", "Форос", "Фролищи", "Фролово", "Фруктовая", "Фрязино", "Фряново", "Фурманов", "Хабаровск", "Хабарское", "Хабез", "Хабоцкое", "Ханты-Мансийск", "Харёнки", "Хатунь", "Хацунь", "Хвалынск", "Хворостьево", "Хийтола", "Хилово", "Химки", "Хлебалово", "Хмелево", "Хмелита", "Хойто-Гол", "Холматка", "Холмогоры", "Холуй", "Холюны", "Хомутово", "Хоршеваши", "Хорьково", "Хоста", "Хотылево", "Хотынец", "Хотьково", "Храброво", "Хреново", "Хреновое", "Хужир", "Хулхута", "Хурай-Хобок", "Хыркасы", "Цаган Аман", "Царёв", "Царевка", "Царёво", "Цемена", "Цивильск", "Цимлянск", "Чабишур", "Чаган-Узун", "Чадан", "Чайковский", "Чапаевск", "Чаплыгин", "Чашниково", "Чвижепсе", "Чебино", "Чебоксары", "Чекалин", "Чекшино", "Челмужи", "Челябинск", "Чемал", "Чемодановка", "Черга", "Чердынь", "Черевково", "Черёмушки", "Черемшанка", "Черемыкино", "Череповец", "Черкасское (Пачелмский р-н)", "Черкесск", "Чернетово", "Черноголовка", "Черногорск", "Черноисточинск", "Черноморское", "Черноруд", "Чернуха", "Чернушка", "Черный Ануй", "Чернь", "Чернянка", "Черняховск", "Черталы", "Чертовицы", "Чесма", "Чехов", "Чехов", "Чике-Таман", "Чимеево", "Чиркино", "Чистополь", "Чистые Пруды", "Чита", "Чишмы", "Чкаловск", "Чудиново", "Чудово", "Чукаыб", "Чупа", "Чусовой", "Чутырь", "Чухлома", "Шаблово", "Шабровский", "Шадринск", "Шаморга", "Шамордино", "Шапкино", "Шапкино", "Шарибоксад", "Шаркан", "Шарья", "Шатки", "Шатура", "Шахе", "Шаховская", "Шахтерск", "Шацк", "Шебекино", "Шексна", "Шелковская", "Шелоховская", "Шелтозеро", "Шемышейка", "Шерегеш", "Шершни", "Шешурино", "Шилово", "Шира", "Широков Погост", "Ширяево", "Шишкин Лес", "Шишкино", "Шлиссельбург", "Шолохово", "Шопино", "Шорново", "Шоршелы", "Шпаньково", "Шувакиш", "Шугайлово", "Шугозеро", "Шулута", "Шумерля", "Шуньга", "Шушенское", "Шуя", "Шыгырдан", "Щеглово", "Щелкино", "Щелково", "Щелыково", "Щербинка", "Щетинкино", "Ыб", "Эдиган", "Электросталь", "Элиста", "Эльбрус", "Эльбрусский", "Эльтон", "Эмеково", "Эммаус", "Энгельс", "Энхалук", "Эрестем", "Эртиль", "Эссойла", "Юдиново", "Южа", "Южно-Сахалинск", "Южноуральск", "Юксеево", "Юность", "Юношеское", "Юрино", "Юрлово", "Юрьев-Польский", "Юрьевец", "Юрьевец (Владимирский р-н)", "Юхнево", "Юхнов", "Юхоть", "Ябоган", "Ядрин", "Язвищи", "Языково", "Языково", "Якимово", "Яковка", "Яковлевка", "Яковлево", "Якты-Куль", "Якутск", "Ялта", "Ялуторовск", "Ям", "Ям-Тесово", "Ямкино", "Ямок", "Янтарный", "Яранск", "Ярбалык"];
  groups = ['Проектный отдел', 'Руководство', 'Отдел кадров', 'Бухгалтерия'];
  nicks = ["Hellstaff", "Anen", "Darkshaper", "blackcoffe", "Dominator", "Skillet", "Blackseeker", "GAMER", "Bloodray", "Bloodfire", "WOGY", "AnnyMars", "Mr_KiLLaURa", "Ironfire", "Topmen", "FEISKO", "Jay", "Kezan", "Akir", "CherryThe Countess ", "Alien", "Alsantrius", "Lightseeker", "Blackbrand", "Quemal", "Aria", "Blackstalker", "breakingthesystem", "Beydar", "CaptainAmerica", "Awene", "Azago", "Bine", "Bliss", "Flas", "Hellblade", "Loni", "Rageseeker", "Velan", "Vikus", "Water", "Zamo", "Amis", "Balladolbine", "Jugami", "OTANO", "Via", "Zacki", "AfinaS", "Bloodhammer", "Cashoutmaster", "Fordrellador", "Groll", "Qusserel", "Ynye", "Zetadda", "AGAD", "Akta", "Arador", "Arihelm", "Arilak", "BoberMod", "Chilldweller", "Connorise", "HiddenWinter", "iSlate", "Kirizan", "Xanzay", "Zeli", "Acebiolane", "allegro", "ARE", "Arith", "Arlana", "artman", "bass", "Bladebringer", "Bluddefender", "Buzalas", "caster", "Ces", "Cha", "Charyoll", "Cordann", "EXIBUZYW", "Fesho", "Jairani", "Juce", "Manris", "Pad", "Quellik", "Reemiel", "Runemane", "Tekasa", "Agarus", "Akinozuru", "Anarahuginn", "Ance", "Andromathris", "ArabellaV.", "Arar", "Bajinn", "Ballalune", "Bandiri", "Beanisend", "Beardana", "Beazerdred", "Bedy", "Bev", "blacwolf", "Brakora", "Bralore", "Briciraz", "Buge", "Burisi", "Buriwield", "Cae", "Cala", "catterpillar", "Cel", "Celen", "Cerar", "Clandratha", "Coiron", "Coron", "Dalarin", "Datrim", "Dori", "Folsa", "Fomand", "Framokay", "Froststalker", "Glei", "Golkree", "GWEZJ", "Jieylau", "Kabandis", "Kamuro", "Kelerana", "Kerry", "Lcena", "Llbery", "Miromice", "Nilador", "Qag", "Quendant", "Tygolar", "Uyehuguita", "Warianys", "Winasana", "Ximathewi", "6snake6", "Abywis", "Adokelv", "Adoranin", "Adorardana", "Adoraris", "Adrielmeena", "Agagamand", "Agalas", "Agalen", "Agantrius", "Akirg", "Akisame", "Alsanadar", "Amarin", "Anaginn", "Anaragelv", "Anarius", "Anasius", "Anayalore", "Andromakus", "Andronrad", "Androrim", "Angana", "Anicasalar", "anneli", "Araath", "Arakus", "Arcanefist", "Arcanescar", "Ariurin", "Arryar", "Arthunter", "Asyasya", "Atineda", "Auau", "Authis", "avanger", "Ballazan", "Barit", "Beabandis", "Beahelm", "Bearus", "Beazezius", "Bele", "Ber", "Beranyle", "Berenn", "Berkohi", "Binar", "Bladecliff", "blodrayne", "Bludsong", "Boraston", "Bragis", "Brakree", "Braswyn", "Breder", "Bremar", "Brialelis", "Brightfury", "Broadcaster", "Broadraven", "Brol", "Bukus", "Bulace", "Burgas", "Buridora", "Burilar", "Butius", "Buzatus", "Carrot", "Ceck", "Cells", "Celore", "Cesar", "Cetnan", "Chilele", "Chinon", "Clever", "Cobandis", "Coidor", "Coiril", "CopamHuk", "Cordalas", "Cordaron", "Cozius", "Dagdalas", "Daizil", "Dellevar", "DerBat", "Dibei", "Drelalak", "Dusar", "Elizabeth", "Faell", "Faulkree", "Fenrinos", "Gashakar", "Gaxaisvem", "Geny", "Gindian", "Goktilar", "Gralinda", "Hanelynai", "Hellmaster", "Hi_Jacker", "Honeirsil", "Hugighma", "hulk", "ImpalaFrozen", "inetserfer", "Ishnllador", "IWantYou", "Jazu", "Jerinovir", "Jia", "Jogas", "Jothris", "Kamick", "Keath", "Khiceog", "Llathidan", "Lli", "Nalme", "ndup", "Nikojas", "Nten", "Qane", "Rare", "Tantil", "Taun", "Ttexav", "Uris", "Vispel", "Waiso", "Walianirv", "Whitebeard", "Whitecaster", "Winail", "X-MEN", "Xal", "xander", "Xarcondre", "Xurad", "Ygglune", "Zainian", "ZeusWooden", "AbandonedElectrical", "Agrainel", "Ahieones", "Akinohn", "Akinonris", "Alsath", "Altad", "Amhirishes", "Anararius", "Anarasida", "Anarawield", "Anardred", "Anayajurus", "Anayanis", "Andromajurus", "Androwyn", "Anyshoun", "Aradwyn", "Arashigore", "Arcanefire", "Ariseym"];
  mail = ['gmail.com', 'mail.ru', 'rambler.ru', 'yahoo.com', 'bk.ru', 'list.mail.ru'];
  rand = 0;

  function getRand( max, min = 0 ) {return min + Math.floor( Math.random() * (max + 1 - min ) );}

  function generateDate() {
    let date;

    date = new Date( `${getRand( 12 )}.${getRand( 31 )}.${getRand( 2000, 1960 )}` );

    if ( '' + date === 'Invalid Date' ) {
      date = generateDate();
    }

    return date;
  }

  fakeData = fakeData.map( item => {
    !item.group && (item.group = groups[getRand( groups.length - 1 )]);
    item.city = cities[getRand( cities.length - 1 )];
    item.dob = generateDate();

    rand = getRand( nicks.length );
    item.nick = nicks[rand];
    nicks.splice( rand, 1 );

    item.mail = `${item.nick}@${mail[getRand( mail.length )]}`;

    return item;
  } );


}


{
  let item = {};

  !item.group && (item.group = groups[getRand( groups.length - 1 )]);
  item.city = cities[getRand( cities.length - 1 )];
  item.dob = generateDate();

  rand = getRand( nicks.length );
  item.nick = nicks[rand];
  nicks.splice( rand, 1 );

  item.mail = `${item.nick}@${mail[getRand( mail.length )]}`;

}
